'''

(1)flask与Django有什么区别
个人更倾向flask，因为它更方便，更灵活，用什么就装什么。不想django那样，都放在那里。就好比你买辆车吧，
django就是什么车胎发动机都给你定下来装好了，而flask的话我可以改改发动机呀改改轮胎呀什么的，根据个人的需求来定制化操作。
flask更轻便。

(2)什么是lambda函数？它有什么好处?
lambda 函数是一个能够接纳任意多个参数(包括可选参数)并且返回单个表达式值的函数。 lambda 函数不能包括指令，它们所包括的表达式不能超过一个。
不要试图向lambda 函数中塞入太多的东西；假如你需要更复杂的东西，应该定义一个一般函数，然后想让它多长就多长。

(3)介绍一下except的用法和作用？
try…except…except…[else…][finally…]

执行try下的语句，如果引发异常，则执行过程会跳到except语句。对每个except分支顺序尝试执行，如果引发的异常与except中的异常组匹配，执行相应的语句。如果所有的except都不匹配，则异常会传递到下一个调用本代码的最高层try代码中。

try下的语句正常执行，则执行else块代码。如果发生异常，就不会执行

如果存在finally语句，最后总是会执行。

(4)如何使用NumPy / SciPy制作3D绘图/可视化？
与2D绘图一样，3D图形超出了NumPy和SciPy的范围，但就像2D情况一样，存在与NumPy集成的包。Matplotlib在mplot3d子包中
提供基本的3D绘图，而Mayavi使用功能强大的VTK引擎提供各种高质量的3D可视化功能。

(5)NumPy和SciPy有什么区别？
NumPy只包含数组数据类型和最基本的操作：索引，排序，重新整形，基本元素函数等等。
所有数字代码都将储存在SciPy中。然而，NumPy的一个重要目标是兼容性，因此NumPy试图保留其前任任何一个支持的所有功能。
NumPy包含一些线性代数函数，而SciPy包含更多全功能的线性代数函数以及许多其他数值算法。
如果你使用python进行科学计算，你应该安装NumPy和SciPy。scipy中提供更多的函数功能。
'''